app/views/orders/order_history.html.erb

	<% @order_hist.each do |history| %>
		<% product=@products.find {|v| v[:id] == history.product_id} %>
---
SELECT "products".* FROM "products"