app/views/orders/order_check.html.erb

			<tr>
				<% product=@products.find {|v| v[:id] == cart.product_id} %>
---
SELECT "products".* FROM "products"