app/views/orders/order_confirmed.html.erb

			<tr>
				<% product=@products.find {|v| v[:id] == order.product_id} %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]