app/views/carts/mycart.html.erb

SELECT "products".* FROM "products"
---
				<tr>
					<% product=@products.find {|v| v[:id] == cart.product_id} %>