app/controllers/carts_controller.rb

	def mycart
		@products=Product.all
		@mycart=Cart.all.where(user_id: session[:user_id])
---
SELECT "products".* FROM "products"
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]

	def add_to_cart
		uid=params[:cart][:user_id]
		pid=params[:cart][:product_id]
		nq=params[:cart][:quantity].to_i
		old_cart=Cart.find_by(product_id: pid, user_id: uid)

		#foo

		if old_cart != nil
			q=old_cart.quantity.to_i
			if (q+nq) > 10
				q=10
			else
				q=q+nq
			end
			old_cart.update(quantity: q)
		else
			cart=Cart.create(user_id: uid, product_id: pid, quantity: nq)
---
SELECT "carts".* FROM "carts" WHERE "carts"."product_id" = ? AND "carts"."user_id" = ? LIMIT ?  [["product_id", 1], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["product_id", 1], ["quantity", 5], ["created_at", "2021-01-28 04:44:06.582521"], ["updated_at", "2021-01-28 04:44:06.582521"]]