app/controllers/home_controller.rb

	def index
		@sample=Product.all.sample(3)
---
SELECT "products".* FROM "products"