app/controllers/orders_controller.rb

	def order_check
		@mycart=Cart.where(user_id: params[:user_id])
		@products=Product.all
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]
SELECT "products".* FROM "products"

	def order_confirmed
		# require "date"
		uid=params[:user_id]
		@mycart=Cart.where(user_id: uid)
		order=Order.create(user_id: uid)
		oid=order.id
		@products=Product.all

		@mycart.each do |cart|
			# 商品を指定
			p=@products.find {|v| v[:id] == cart.product_id}
			# 在庫を減らす
			p.update(stock: (p.stock-cart.quantity))
			# 注文明細に登録
			od=Orderdetail.create(order_id: oid,user_id: uid, product_id: cart.product_id,quantity: cart.quantity,old_price: p.price)
		end

		order.save
		@mycart.destroy_all

		@od=Orderdetail.where(order_id: oid)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2021-01-28 04:44:19.084645"], ["updated_at", "2021-01-28 04:44:19.084645"]]
SELECT "products".* FROM "products"
UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock", 5], ["updated_at", "2021-01-28 04:44:19.134327"], ["id", 1]]
INSERT INTO "orderdetails" ("order_id", "product_id", "quantity", "created_at", "updated_at", "user_id", "old_price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["order_id", 1], ["product_id", 1], ["quantity", 5], ["created_at", "2021-01-28 04:44:19.261697"], ["updated_at", "2021-01-28 04:44:19.261697"], ["user_id", 1], ["old_price", 3520]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
SELECT "orderdetails".* FROM "orderdetails" WHERE "orderdetails"."order_id" = ?  [["order_id", 1]]

	def order_history
		if session[:user_id] != nil
			uid=session[:user_id]
		elsif params[:user_id] != nil
			uid=params[:user_id]
		else
			redirect_to "/"
			return
		end
		@products=Product.all
		@order_hist=Orderdetail.where(user_id: uid).order(id: :desc).order(product_id: :asc)
---
SELECT "products".* FROM "products"
SELECT "orderdetails".* FROM "orderdetails" WHERE "orderdetails"."user_id" = ? ORDER BY "orderdetails"."id" DESC, "orderdetails"."product_id" ASC  [["user_id", 1]]