app/controllers/products_controller.rb

	def products_index
		@products=Product.order(category: :asc).page params[:page]
---
SELECT "products".* FROM "products" ORDER BY "products"."category" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "products" ORDER BY "products"."category" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]

	def product_detail
		@product=Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

	def update
		@product=Product.find_by(id: params[:product][:id])
		if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "ab8ba31c-5a11-4ab6-b0f9-3675142c5be7.jpg"], ["updated_at", "2020-12-10 06:40:52.296727"], ["id", 1]]