app/controllers/sessions_controller.rb

	def create
		user=User.find_by(mail: params[:session][:mail].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."mail" = ? LIMIT ?  [["mail", "admin@konozama.co.jp"], ["LIMIT", 1]]

	def check
		@state=true
		if !view_context.logged_in?
			@state=false
		else
			@user=view_context.current_user
		end

		if @user == nil || @user.admin == false
			@state=false
		end

		if @state
			@products=Product.all
---
SELECT "products".* FROM "products"

	def checkedit
		@state=true
		if !view_context.logged_in?
			@state=false
		else
			@user=view_context.current_user
		end

		if @user == nil || @user.admin == false
			@state=false
		end

		if @state
			@product=Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]